RT-Thread/rt-thread/bsp/stm32f20x/Libraries/STM32F2xx_StdPeriph_Driver/src/stm32f2xx_hash.c
/**
  ******************************************************************************
  * @file    stm32f2xx_hash.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    18-April-2011
  * @brief   This file provides firmware functions to manage the following
  *          functionalities of the HASH / HMAC Processor (HASH) peripheral:
  *           - Initialization and Configuration functions
  *           - Message Digest generation functions
  *           - context swapping functions
  *           - DMA interface function
  *           - Interrupts and flags management
  *
  *  @verbatim
  *
  *          ===================================================================
  *                                   How to use this driver
  *          ===================================================================
  *          HASH operation :
  *          ----------------
  *         1. Enable the HASH controller clock using
  *            RCC_AHB2PeriphClockCmd(RCC_AHB2Periph_HASH, ENABLE) function.
  *
  *         2. Initialise the HASH using HASH_Init() function.
  *
  *         3 . Reset the HASH processor core, so that the HASH will be ready
  *             to compute he message digest of a new message by using
  *             HASH_Reset() function.
  *
  *         4. Enable the HASH controller using the HASH_Cmd() function.
  *
  *         5. if using DMA for Data input transfer, Activate the DMA Request
  *            using HASH_DMACmd() function
  *
  *         6. if DMA is not used for data transfer, use HASH_DataIn() function
  *            to enter data to IN FIFO.
  *
  *
  *         7. Configure the Number of valid bits in last word of the message
  *            using HASH_SetLastWordValidBitsNbr() function.
  *
  *         8. if the message length is not an exact multiple of 512 bits,
  *            then the function HASH_StartDigest() must be called to
  *            launch the computation of the final digest.
  *
  *         9. Once computed, the digest can be read using HASH_GetDigest()
  *            function.
  *
  *        10. To control HASH events you can use one of the following
  *              two methods:
  *               a- Check on HASH flags using the HASH_GetFlagStatus() function.
  *               b- Use HASH interrupts through the function HASH_ITConfig() at
  *                  initialization phase and HASH_GetITStatus() function into
  *                  interrupt routines in hashing phase.
  *          After checking on a flag you should clear it using HASH_ClearFlag()
  *          function. And after checking on an interrupt event you should
  *          clear it using HASH_ClearITPendingBit() function.
  *
  *        11. Save and restore hash processor context using
  *            HASH_SaveContext() and HASH_RestoreContext() functions.
  *
  *
  *
  *          HMAC operation :
  *          ----------------
  *          The HMAC algorithm is used for message authentication, by
  *          irreversibly binding the message being processed to a key chosen
  *          by the user.
  *          For HMAC specifications, refer to "HMAC: keyed-hashing for message
  *          authentication, H. Krawczyk, M. Bellare, R. Canetti, February 1997"
  *
  *          Basically, the HMAC algorithm consists of two nested hash operations:
  *          HMAC(message) = Hash[((key | pad) XOR 0x5C) | Hash(((key | pad) XOR 0x36) | message)]
  *          where:
  *          - "pad" is a sequence of zeroes needed to extend the key to the
  *                  length of the underlying hash function data block (that is
  *                  512 bits for both the SHA-1 and MD5 hash algorithms)
  *          - "|"   represents the concatenation operator
  *
  *
  *         To compute the HMAC, four different phases are required:
  *
  *         1.  Initialise the HASH using HASH_Init() function to do HMAC
  *             operation.
  *
  *         2.  The key (to be used for the inner hash function) is then given
  *             to the core. This operation follows the same mechanism as the
  *             one used to send the message in the hash operation (that is,
  *             by HASH_DataIn() function and, finally,
  *             HASH_StartDigest() function.
  *
  *         3.  Once the last word has been entered and computation has started,
  *             the hash processor elaborates the key. It is then ready to
  *             accept the message text using the same mechanism as the one
  *             used to send the message in the hash operation.
  *
  *         4.  After the first hash round, the hash processor returns "ready"
  *             to indicate that it is ready to receive the key to be used for
  *             the outer hash function (normally, this key is the same as the
  *             one used for the inner hash function). When the last word of
  *             the key is entered and computation starts, the HMAC result is
  *             made available using HASH_GetDigest() function.
  *
  *
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f2xx_hash.h"
#include "stm32f2xx_rcc.h"

/** @addtogroup STM32F2xx_StdPeriph_Driver
  * @{
  */

/** @defgroup HASH
  * @brief HASH driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup HASH_Private_Functions
  * @{
  */

/** @defgroup HASH_Group1 Initialization and Configuration functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
                      Initialization and Configuration functions
 ===============================================================================
  This section provides functions allowing to
   - Initialize the HASH peripheral
   - Configure the HASH Processor
      - MD5/SHA1,
      - HASH/HMAC,
      - datatype
      - HMAC Key (if mode = HMAC)
   - Reset the HASH Processor

@endverbatim
  * @{
  */

/**
  * @brief  Deinitializes the HASH peripheral registers to their default reset values
  * @param  None
  * @retval None
  */
void HASH_DeInit(void)
{
  /* Enable HASH reset state */
  RCC_AHB2PeriphResetCmd(RCC_AHB2Periph_HASH, ENABLE);
  /* Release HASH from reset state */
  RCC_AHB2PeriphResetCmd(RCC_AHB2Periph_HASH, DISABLE);
}

/**
  * @brief  Initializes the HASH peripheral according to the specified parameters
  *         in the HASH_InitStruct structure.
  * @note   the hash processor is reset when calling this function so that the
  *         HASH will be ready to compute the message digest of a new message.
  *         There is no need to call HASH_Reset() function.
  * @param  HASH_InitStruct: pointer to a HASH_InitTypeDef structure that contains
  *         the configuration information for the HASH peripheral.
  * @note   The field HASH_HMACKeyType in HASH_InitTypeDef must be filled only
  *          if the algorithm mode is HMAC.
  * @retval None
  */
void HASH_Init(HASH_InitTypeDef* HASH_InitStruct)
{
  /* Check the parameters */
  assert_param(IS_HASH_ALGOSELECTION(HASH_InitStruct->HASH_AlgoSelection));
  assert_param(IS_HASH_DATATYPE(HASH_InitStruct->HASH_DataType));
  assert_param(IS_HASH_ALGOMODE(HASH_InitStruct->HASH_AlgoMode));

  /* Configure the Algorithm used, algorithm mode and the datatype */
  HASH->CR &= ~ (HASH_CR_ALGO | HASH_CR_DATATYPE | HASH_CR_MODE);
  HASH->CR |= (HASH_InitStruct->HASH_AlgoSelection | \
               HASH_InitStruct->HASH_DataType | \
               HASH_InitStruct->HASH_AlgoMode);

