RT-Thread/rt-thread/bsp/stm32f20x/Libraries/STM32F2xx_StdPeriph_Driver/src/stm32f2xx_hash.c
  /* restore context registers */
  HASH->IMR = HASH_ContextRestore->HASH_IMR;
  HASH->STR = HASH_ContextRestore->HASH_STR;
  HASH->CR = HASH_ContextRestore->HASH_CR;

  /* Initialize the hash processor */
  HASH->CR |= HASH_CR_INIT;

   /* continue restoring context registers */
  for(i=0; i<=50;i++)
  {
     HASH->CSR[i] = HASH_ContextRestore->HASH_CSR[i];
  }
}
/**
  * @}
  */

/** @defgroup HASH_Group4 HASH's DMA interface Configuration function
 *  @brief   HASH's DMA interface Configuration function
 *
@verbatim
 ===============================================================================
                   HASH's DMA interface Configuration function
 ===============================================================================

  This section provides functions allowing to configure the DMA interface for
  HASH/ HMAC data input transfer.

  When the DMA mode is enabled (using the HASH_DMACmd() function), data can be
  sent to the IN FIFO using the DMA peripheral.



@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the HASH DMA interface.
  * @note   The DMA is disabled by hardware after the end of transfer.
  * @param  NewState: new state of the selected HASH DMA transfer request.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void HASH_DMACmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the HASH DMA request */
    HASH->CR |= HASH_CR_DMAE;
  }
  else
  {
    /* Disable the HASH DMA request */
    HASH->CR &= ~HASH_CR_DMAE;
  }
}
/**
  * @}
  */

/** @defgroup HASH_Group5 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions
 *
@verbatim
 ===============================================================================
                   Interrupts and flags management functions
 ===============================================================================

  This section provides functions allowing to configure the HASH Interrupts and
  to get the status and clear flags and Interrupts pending bits.

  The HASH provides 2 Interrupts sources and 5 Flags:

  Flags :
  ----------
     1. HASH_FLAG_DINIS : set when 16 locations are free in the Data IN FIFO
                          which means that a  new block (512 bit) can be entered
                          into the input buffer.

     2. HASH_FLAG_DCIS :  set when Digest calculation is complete

     3. HASH_FLAG_DMAS :  set when HASH's DMA interface is enabled (DMAE=1) or
                          a transfer is ongoing.
                          This Flag is cleared only by hardware.

     4. HASH_FLAG_BUSY :  set when The hash core is processing a block of data
                          This Flag is cleared only by hardware.

     5. HASH_FLAG_DINNE : set when Data IN FIFO is not empty which means that
                          the Data IN FIFO contains at least one word of data.
                          This Flag is cleared only by hardware.

  Interrupts :
  ------------

   1. HASH_IT_DINI  : if enabled, this interrupt source is pending when 16
                      locations are free in the Data IN FIFO  which means that
                      a new block (512 bit) can be entered into the input buffer.
                      This interrupt source is cleared using
                      HASH_ClearITPendingBit(HASH_IT_DINI) function.

   2. HASH_IT_DCI   : if enabled, this interrupt source is pending when Digest
                      calculation is complete.
                      This interrupt source is cleared using
                      HASH_ClearITPendingBit(HASH_IT_DCI) function.

  Managing the HASH controller events :
  ------------------------------------
  The user should identify which mode will be used in his application to manage
  the HASH controller events: Polling mode or Interrupt mode.

  1.  In the Polling Mode it is advised to use the following functions:
      - HASH_GetFlagStatus() : to check if flags events occur.
      - HASH_ClearFlag()     : to clear the flags events.

  2.  In the Interrupt Mode it is advised to use the following functions:
      - HASH_ITConfig()       : to enable or disable the interrupt source.
      - HASH_GetITStatus()    : to check if Interrupt occurs.
      - HASH_ClearITPendingBit() : to clear the Interrupt pending Bit
                                (corresponding Flag).

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the specified HASH interrupts.
  * @param  HASH_IT: specifies the HASH interrupt source to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg HASH_IT_DINI: Data Input interrupt
  *            @arg HASH_IT_DCI: Digest Calculation Completion Interrupt
  * @param  NewState: new state of the specified HASH interrupt.
  *           This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void HASH_ITConfig(uint8_t HASH_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_HASH_IT(HASH_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected HASH interrupt */
    HASH->IMR |= HASH_IT;
  }
  else
  {
    /* Disable the selected HASH interrupt */
    HASH->IMR &= (uint8_t) ~HASH_IT;
  }
}

/**
  * @brief  Checks whether the specified HASH flag is set or not.
  * @param  HASH_FLAG: specifies the HASH flag to check.
  *          This parameter can be one of the following values:
  *            @arg HASH_FLAG_DINIS: Data input interrupt status flag
  *            @arg HASH_FLAG_DCIS: Digest calculation completion interrupt status flag
  *            @arg HASH_FLAG_BUSY: Busy flag
  *            @arg HASH_FLAG_DMAS: DMAS Status flag
  *            @arg HASH_FLAG_DINNE: Data Input register (DIN) not empty status flag
  * @retval The new state of HASH_FLAG (SET or RESET)
  */
FlagStatus HASH_GetFlagStatus(uint16_t HASH_FLAG)
{
  FlagStatus bitstatus = RESET;
  uint32_t tempreg = 0;

  /* Check the parameters */
  assert_param(IS_HASH_GET_FLAG(HASH_FLAG));

  /* check if the FLAG is in CR register */
  if ((HASH_FLAG & HASH_FLAG_DINNE) != (uint16_t)RESET )
  {
    tempreg = HASH->CR;
  }
  else /* The FLAG is in SR register */
  {
    tempreg = HASH->SR;
  }

  /* Check the status of the specified HASH flag */
  if ((tempreg & HASH_FLAG) != (uint16_t)RESET)
  {
    /* HASH is set */
    bitstatus = SET;
  }
  else
  {
    /* HASH_FLAG is reset */
    bitstatus = RESET;
  }

  /* Return the HASH_FLAG status */
  return  bitstatus;
}
/**
  * @brief  Clears the HASH flags.
  * @param  HASH_FLAG: specifies the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg HASH_FLAG_DINIS: Data Input Flag
  *            @arg HASH_FLAG_DCIS: Digest Calculation Completion Flag
  * @retval None
  */
void HASH_ClearFlag(uint16_t HASH_FLAG)
{
  /* Check the parameters */
  assert_param(IS_HASH_CLEAR_FLAG(HASH_FLAG));

